{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
            "Hi",
            "Hello",
            "Hey",
            "What's up",
            "Hi there",
            "Greetings",
            "Good morning",
            "Good afternoon",
            "Good evening"
            ],
            "responses": [
            "Hello! How can I help you?",
            "Hi there! How can I assist you today?",
            "Greetings! What can I do for you?"
            ]
        },
        {
            "tag": "goodbye",
            "patterns": [
            "Bye",
            "Goodbye",
            "See you later",
            "See you soon",
            "Take care",
            "Farewell"
            ],
            "responses": [
            "Goodbye! Have a nice day.",
            "See you later! Take care.",
            "Farewell! Come back soon."
            ]
        },
        {
            "tag": "thanks",
            "patterns": [
            "Thanks",
            "Thank you",
            "Appreciate it",
            "Grateful"
            ],
            "responses": [
            "You're welcome!",
            "No problem, happy to help.",
            "Glad I could be of assistance."
            ]
        },
        {
            "tag": "help",
            "patterns": [
            "Can you help me?",
            "What can you do for me?",
            "I need assistance",
            "Can you assist me?",
            "Help please"
            ],
            "responses": [
            "Of course! What do you need help with?",
            "Sure, what do you need assistance with?",
            "I'm here to help. What can I do for you?"
            ]
        },
        {
            "tag": "name",
            "patterns": ["what is your name", "what should I call you", "who are you"],
            "responses": ["My name is guideBot. How can I assist you?", "You can call me guideBot.", "I am guideBot, at your service."]
        },
        {
            "tag": "college_info",
            "patterns": ["what is the address of the college", "what are the courses offered", "what is the website of the college"],
            "responses": ["The address of the college is nitte. The college has more than 10 branches of engineering. The website of the college is www.nitte.edu."]
        },
        {
            "tag": "library",
            "patterns": ["where is the library", "what is the location of the library", "where can I find the library?","Where can i go to study?", "library","books" ,"silence"],
            "responses": ["The library is located on the first floor of the main building. You can spot the main building by either finding SAC, which is a colourful building outside the rear entrance of the main building, or you can also find the front eantrance near the flagpole"]
        },
        
        {
            "tag": "admissions",
            "patterns": ["what are the admission requirements", "how can I apply to the college", "what is the deadline to apply"],
            "responses": ["The admission requirements vary depending on the program. You can apply to the college online at www.college.edu/admissions. The deadline to apply is January 1st."]
        },
        {
            "tag": "missing_exam",
            "patterns": ["what should I do if I missed an exam", "what is the policy for missed exams", "how can I make up a missed exam", "missing exam", "missed exam", "absent exam"],
            "responses": ["If you missed an exam, you should contact your professor as soon as possible to see if you can make it up. Usually, You need to write a letter to the HoD, who may allow you to write a make up exam."]
        },
        
        {
            "tag": "principal_office",
            "patterns": [
            "Where can I find the Principal's office?",
            "Where is the Principal's office?",
            "Where is the Administration block located?",
            "Can you tell me the location of the principal's office?"
            ],
            "responses": [
            "The Principal's office is located in the Administration block, on the first floor.",
            "The Administration block is located near the main entrance. You can find the Principal's office on the first floor."
            ]
        },
        {
            "tag": "vice_chancellor_office",
            "patterns": [
            "Vice Chancellor",
            "Where can I find the Vice Chancellor's office?",
            "Where is the Vice Chancellor's office?",
            "I need to visit the Vice Chancellor's office, where is it?",
            "Can you tell me the location of the Vice Chancellor's office?"
            ],
            "responses": [
            "The Vice Chancellor's office is located in the Administration block, on the second floor."
            ]
        },
        {
            "tag": "lc_block",
            "patterns": [
            "How do I find the classroom LC01?",
            "Where is the lecture hall LC21 located?",
            "Where is LC11?",
            "Can you tell me the location of the classroom LC31?",
            "I have a class in room LC11, where is it located?"
            ],
            "responses": [
            "Classroom LC01 is located in the East wing, on the ground floor.",
            "Lecture hall LC21 is located in the Ramanujan Block on second floor",
            "Classroom LC31 is located in the Ramanujan Block, on the third floor.",
            "LC11 is located in the ramanujan block, on the first floor."
            ]
        },
        {
            "tag": "lh_block",
            "patterns": [
            "How do I find the classroom LH001?",
            "Where is the lecture hall LH201?",
            "Where is LH001?",
            "Where is classroom LH311?",
            "Can you tell me the location of the classroom LH301?"
        ],
        "responses": [
            "Classroom LH001 is located in the East wing, on the ground floor.",
            "Lecture hall LH201 is located in the Main Block on second floor",
            "Classroom LH301 is located in the Main Block, on the third floor.",
            "LH501 is located in the main block, on the fifth floor."
        ]
    },
    {
        "tag":"cs_labs",
        "patterns":[
                "Where do I find CS labs?",
                "Where is CS lab?",
                "in which block is CS lab?",
                "Where is CSL01",
                "CSL01",
                "CSL02",
                "CSL03",
                "CSL04",
                "CS Labs"
            ],
        "responses":[
            "The CS labs can be found in the fourth floor of APJ Block.",
            "All the IS department labs can be found on the fourth floor of APJ block."
        ]
    },
    {
        "tag":"is_lab",
        "patterns":[
            "Where do I find IS labs?",
            "Where is IS lab?",
            "in which block is IS lab?",
            "Where do I find IS Lab?",
            "ISL02",
            "ISL01",
            "ISL03",
            "IS Labs"

        ],
        "responses":[
            "The IS labs can be found on the fourth floor",
            "All the IS department labs can be found on the fourth floor of APJ block."
        ]
    },
    {
            "tag": "buspass",
            "patterns": [
            "How can I get myself a college bus pass?",
            "What is the procedure to obtain a bus pass?",
            "Can you guide me on how to apply for a bus pass?",
            "I need a bus pass, how can I get one?"
            ],
            "responses": [
            "You can obtain a bus pass from the college transport office, by talking to the transport officer. You will need to take a passport size photo with you."
            ]
        },
        {
            "tag":"canteen",
            "patterns":[
                "Where is the canteen?",
                "How do I get to the canteen?",
                "Where can I have my lunch?",
                "I am hungry, where do i go?",
                "food",
                "hungry",
                "eat"
            ],
            "responses":[
                "The canteen is behind the civil block.",
                "The canteen is near the NC block.",
                "You can go to the canteen to eat"
            ]
        }
    ]
}
    